erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/AccumulationRegisters/ДвиженияСерийТоваров/ДвиженияСерийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1beaafd4-9e83-4fef-a24b-2ed1ba072beb">
  <name>ДвиженияСерийТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <dimensions extendedConfigurationObject="c0d120e9-7ff3-481b-9744-9fcd3fefabfc">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="dbc39670-ee82-4e26-844b-f35d4c1c5544">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/Enums/СХК_ВМестимость/СХК_ВМестимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СХК_ВМестимость</name>
  <enumValues>
    <name>Палет</name>
  </enumValues>
  <enumValues>
    <name>Сборный</name>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Documents/СХК_Перемещение/СХК_Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СХК_Перемещение</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>НЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/Forms/ФормаПеремещение/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ЗаполнитьСотрудника(ВладелецФормы.Сотрудник);
	СтартТайминг() ;

	АктивироватьПолеПоискШКQr();
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСотрудника(ИмяПользователя) 
	ЭтаФорма.Сотрудник = Пользователи.ПользовательПоНаименованию(ИмяПользователя);
	Обработки.СХК_МобильныйСклад.ИзменитьТайминг(ЭтаФорма.Сотрудник)
КонецПроцедуры 

&НаСервере
Процедура СтартТайминг() 
	Обработки.СХК_МобильныйСклад.ИзменитьТайминг(ЭтаФорма.Сотрудник)
КонецПроцедуры


&НаКлиенте
Процедура АктивироватьПолеПоискШКQr() Экспорт
	
	ЭтаФорма.Элементы.ПоискШКQr.РедактированиеТекста = Истина;
	ОчиститьШКСервер(); 
	Элементы.ПоискШКQr.ОбновитьТекстРедактирования();
	Элементы.ПоискШКQr.Видимость = Ложь;
	Элементы.ПоискШКQr.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ПоискШКQr; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ПоискШКQr = "";
КонецПроцедуры


&НаКлиенте
Процедура ПоискШКQrИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ПроверкаНаЧисло(Текст) = Истина Тогда
		ЭтаФорма.Элементы.ТекстО.Заголовок = "Отсканируйте qr код"; 
		АктивироватьПолеПоискШКQr();
	Иначе
		ЭтаФорма.Элементы.ГруппаНоменклатура.Видимость = Истина;
		Мас = Новый Массив;
		Если СтрНайти(Текст, ";") = 0 Тогда
			Если НайтиНоменклатуруПоСерии(Текст) = Истина Тогда
				ОткрытьФормуФормаСканШК(Текст);		
			Иначе
				ОткрытьФормуСообщения("Номенклатура не найдена"); 
				АктивироватьПолеПоискШКQr();
			КонецЕсли;
		Иначе
			Мас = Разложить(Текст,";");
			Если НайтиНоменклатуруПоСерии(Мас[0]) = Истина Тогда 
				Если ЗаполнитьСведенияУпаковка(Мас[1]) = Истина Тогда
					АктивироватьПолеОткуда();
				Иначе
					ОткрытьФормуСообщения("Упаковка не найдена"); 
				КонецЕсли;					
			Иначе
				ОткрытьФормуСообщения("Номенклатура не найдена"); 
				АктивироватьПолеПоискШКQr();
			КонецЕсли;
				
		КонецЕсли;
			
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуФормаСканШК(Штр) 
		Отбор = Новый Структура;
		Отбор.Вставить("Штрих",Штр);
		Отбор.Вставить("Серия",ЭтаФорма.Серия);
		Отбор.Вставить("Номенклатура",ЭтаФорма.Номенклатура);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(Отбор,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСообщенияСканШК", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаСканШК", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСообщенияСканШК(Значение, ДопПараметры) Экспорт 
	Если ЗначениеЗаполнено(Значение) Тогда
		Если Значение.Ош = Истина Тогда 
			Если ЗаполнитьСведенияУпаковка(Значение.Штр) = Истина Тогда
				АктивироватьПолеОткуда();
			Иначе
				ОткрытьФормуСообщения("Упаковка не найдена"); 
			КонецЕсли;					
		Иначе
			ОткрытьФормуСообщения(Строка(Значение.Ошибка));	
		КонецЕсли;
	Иначе
		ОткрытьФормуСообщения("Штрих код не найден");	
	КонецЕсли;
	
	
КонецПроцедуры  


&НаКлиенте
Процедура АктивироватьПолеОткуда() 
	ОчиститьАдресОткуда(); 
	Элементы.СканОткуда.ОбновитьТекстРедактирования();
	Элементы.СканОткуда.Видимость = Ложь;
	Элементы.СканОткуда.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканОткуда; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьАдресОткуда()
	СканОткуда = ""; 
	ЭтаФорма.ЯчейкаОтправитель =  Справочники.СХК_СкладЯчейки.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура АдресОткудаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) 
	ош = СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресОткуда(Текст);
	Если СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресОткуда(Текст) = Истина Тогда  
		АктивироватьПоискКуда();
	Иначе
		ОткрытьФормуСообщения(Строка(ош));	
	КонецЕсли;
КонецПроцедуры  


&НаСервере
Функция СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресОткуда(ШтрихКод)   
	спрЯчейка = Справочники.СХК_СкладЯчейки.НайтиПоРеквизиту("ШтрихКод",ШтрихКод); 
	Если спрЯчейка.Пустая() Тогда
		Возврат "Ячейка не найдена";
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СХК_СкладЯчейки.Ссылка КАК Ссылка
		               |ИЗ
		               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
		               |		ПО СХК_ТоварыНаСкладеОстатки.Ячейка = СХК_СкладЯчейки.Ссылка
		               |ГДЕ
		               |	СХК_ТоварыНаСкладеОстатки.Номенклатура = &Номенклатура
		               |	И СХК_СкладЯчейки.Ссылка = &Ссылка";   
		Запрос.УстановитьПараметр("Ссылка",спрЯчейка.Ссылка); 
		Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура); 
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЯчейкаОтправитель = Результат.Ссылка; 
			Возврат Истина;
		Иначе
			Возврат "Товара нет в ячейке";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура АктивироватьПоискКуда() 
	ОчиститьАдресКуда();
	Элементы.СканКуда.ОбновитьТекстРедактирования();
	Элементы.СканКуда.Видимость = Ложь;
	Элементы.СканКуда.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканКуда; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьАдресКуда()
	СканКуда = ""; 
	ЭтаФорма.ЯчейкаПолучатель =  Справочники.СХК_СкладЯчейки.ПустаяСсылка();
КонецПроцедуры


&НаКлиенте
Процедура СканЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка) 
	
	НаполнениеЯчейки = СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресКуда(Текст);
	
	Если НаполнениеЯчейки = Истина Тогда  
		Элементы.Количество.Доступность = Истина;
		АктивироватьПолеКоличество();
	Иначе 
		Элементы.Количество.Доступность = Ложь;
		ОткрытьФормуСообщения(НаполнениеЯчейки);	
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция СканЯчейкиИзменениеТекстаРедактированияНаСервереАдресКуда(ШтрихКод)   

	спрЯчейка = Справочники.СХК_СкладЯчейки.НайтиПоРеквизиту("ШтрихКод",ШтрихКод); 
	Если спрЯчейка.Пустая() Тогда
		Возврат "Ячейка не найдена";
	Иначе
		Если спрЯчейка.Ссылка.Блокировка = Истина Тогда
			Возврат "Ячейка заблокирована";
		Иначе
			ЭтаФорма.ЯчейкаПолучатель = спрЯчейка.Ссылка;//Результат.Ссылка; 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура АктивироватьПолеКоличество() 
	ОчиститьКоличество();
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьКоличество()
	Количество = 0; 
	ЭтаФорма.Количество =  0;
КонецПроцедуры

////////////////////////////////////////////////////////////////////// 
&НаКлиенте
Процедура ОткрытьФормуСообщения(Сообщение) 
	Отбор = Новый Структура;
	Отбор.Вставить("Ошибка",Строка(Сообщение));
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(Отбор,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСообщения", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаСообщений", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСообщения(Значение, ДопПараметры) Экспорт 
						
КонецПроцедуры


&НаСервере
Функция НайтиНоменклатуруПоСерии(Сер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
	               |	ДвиженияСерийТоваров.Серия КАК Серия
	               |ИЗ
	               |	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	               |ГДЕ
	               |	ДвиженияСерийТоваров.Серия.Наименование = &Наименование
	               |	И (ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаПродукцииИзПроизводства)
	               |			ИЛИ ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКлиенту)
	               |			ИЛИ ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаСобранныхКомплектов)
				   |ИЛИ ДвиженияСерийТоваров.СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаПоПеремещению))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДвиженияСерийТоваров.Регистратор УБЫВ";

	Запрос.УстановитьПараметр("Наименование",Сер);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Серия = Рез[0].Серия;
		ЭтаФорма.Номенклатура = Рез[0].Номенклатура;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьСведенияУпаковка(Штр) 

    ЭтаФорма.УпаковкаУп = СХК_ТСДСклад.ЗаполнитьУпаковкаУп(Штр,ЭтаФорма.Номенклатура); 
	Если ЭтаФорма.УпаковкаУп <> Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


//////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции 

Функция Разложить(Знач Стр, Разделитель = ";") Экспорт
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Список.Добавить(Стр);
	
	Возврат Список;
	
КонецФункции 

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПереместитьНаСервере()
	Перем Результат;
	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");

	Если ЭтаФорма.Количество <= 0 Тогда
		Результат.ТекстОшибки = "Заполните количество";
		Возврат Результат;
	КонецЕсли;

	Если ЭтаФорма.ЯчейкаОтправитель = Справочники.СХК_СкладЯчейки.ПустаяСсылка() Или ЭтаФорма.ЯчейкаПолучатель
		= Справочники.СХК_СкладЯчейки.ПустаяСсылка() Тогда
		Результат.ТекстОшибки = "Отсканируйте ячейки еще раз!!!";
		Возврат Результат;
	КонецЕсли;

	ТекДок = НайтиИлиСоздатьДокументПеремещения();
	//На время инвентов
	//Если ЭтаФорма.ЯчейкаОтправитель.ШтрихКод <> "0000003720000" И ЭтаФорма.Количество * ЭтаФорма.УпаковкаУп.Числитель > СХК_ТСДСклад.ОстатокЯчейкаНоменклатура(ЭтаФорма.ЯчейкаОтправитель, ЭтаФорма.Номенклатура,
	Если ЭтаФорма.Количество * ЭтаФорма.УпаковкаУп.Числитель > СХК_ТСДСклад.ОстатокЯчейкаНоменклатура(ЭтаФорма.ЯчейкаОтправитель, ЭтаФорма.Номенклатура,
		ЭтаФорма.Серия.Наименование, ТекДок.Дата) Тогда
		Результат.ТекстОшибки = "Не достаточно товара в ячейка!!!";
		Возврат Результат;
	КонецЕсли;

	НоваяСтрока = ТекДок.ТЧТовары.Добавить();
	НоваяСтрока.Номенклатура = ЭтаФорма.Номенклатура;
	НоваяСтрока.Серия = ЭтаФорма.Серия;
	НоваяСтрока.ТекЯчейка = ЭтаФорма.ЯчейкаОтправитель;
	НоваяСтрока.НЯчейка = ЭтаФорма.ЯчейкаПолучатель;
	НоваяСтрока.Количество = ЭтаФорма.Количество * ЭтаФорма.УпаковкаУп.Числитель;
	НоваяСтрока.Время = ТекущаяДата();
	НоваяСтрока.Пользователь = ЭтаФорма.Сотрудник;
	Попытка
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Успех = Истина;
	Исключение
		Результат.ТекстОшибки = "Ошибка перемещения: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;
КонецФункции

&НаСервере
Функция НайтиИлиСоздатьДокументПеремещения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СХК_Перемещение.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СХК_Перемещение КАК СХК_Перемещение
	               |ГДЕ
	               |	СХК_Перемещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И СХК_Перемещение.ПометкаУдаления = ЛОЖЬ
	               |	И СХК_Перемещение.Проведен = ИСТИНА
	               |	И СХК_Перемещение.Автор = &Автор"; 
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДатаСеанса())); 
	Запрос.УстановитьПараметр("Автор", ЭтаФорма.Сотрудник.Ссылка); 

	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка.ПолучитьОбъект();
	Иначе
		ТекДок = Документы.СХК_Перемещение.СоздатьДокумент();
		ТекДок.Дата = ТекущаяДатаСеанса();
		ТекДок.Автор = ЭтаФорма.Сотрудник;
		Возврат ТекДок;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Переместить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Сотрудник) Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПереместить", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Не выбран сотрудник!", 5, "Ошибка перемещения");
		Возврат;
	КонецЕсли;
		
	Если ПроверитьВместимость() Then	
		РезультатСервера = ПереместитьНаСервере();
		
		Если НЕ РезультатСервера.Успех Тогда 
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПереместить", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение, РезультатСервера.ТекстОшибки, 5, "Ошибка перемещения");
		Иначе	
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеПереместить", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Нет места в ячейке", 5, "Ошибка перемещения");
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеПереместить(Параметры) Экспорт  

КонецПроцедуры  


&НаСервере
Функция ПроверитьВместимость() 
	Если ЭтаФорма.ЯчейкаПолучатель.ШтрихКод = "0000003720000" Тогда
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВЫБОР
	|		КОГДА СХК_ТоварыНаСкладеОстатки.Ячейка.ВМестимость = ЗНАЧЕНИЕ(Перечисление.СХК_ВМестимость.Палет)
	|			ТОГДА 20000 - СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток
	|		ИНАЧЕ 300000 - СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК Лимит
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";   
	Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.ЯчейкаПолучатель); 
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Если Результат.Лимит >= ЭтаФорма.Количество*ЭтаФорма.УпаковкаУп.Числитель Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
